Documents/ВводОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВводОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.МатериалыВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПерсоналом</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПодотчетниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОперацийВводаОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БонусыКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬ_ВзаиморасчетыСКонтрагентамиВВалюте</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКасса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыВЭксплуатации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетыСПерсоналом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетыСПодотчетниками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыНаСкладах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыОперацийВводаОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОперацийВводаОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварыНаСкладах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПодотчетниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводОстатков/Forms/ФормаЗагрузкиИзExcel/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипОперации = Параметры.ТипОперации;
	Организация = Параметры.Организация;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Группа" + СтрЗаменить(НРег(ТипОперации), " ", "")];
	
	РазрешенаОтрицательнаяСумма = (ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ВзаиморасчетыСКонтрагентами);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачСтр = 1;
//	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент И НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		АдресВХранилище = ЗаписатьРезультатВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресВХранилище <> Неопределено Тогда
		Структура = Новый Структура("АдресВХранилище", АдресВХранилище);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр =  "Файлы Excel|*.xls;*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл Excel";
	ДиалогОткрытияФайла.Выбрать();
	ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКолонкиЦенаПриИзменении(Элемент)
	
	НомерКолонкиСумма = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКолонкиСуммаПриИзменении(Элемент)
	
	НомерКолонкиЦена = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКЗагрузкеКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеКЗагрузке.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКЗагрузкеЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеКЗагрузке.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКЗагрузкеСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеКЗагрузке.ТекущиеДанные;
	Если НЕ РазрешенаОтрицательнаяСумма И ТекущиеДанные.Сумма < 0 Тогда
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
	
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Цена = ТекущиеДанные.Сумма;
	Иначе
		ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКЗагрузкеКоличество1ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеКЗагрузке4.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКЗагрузкеЦена1ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеКЗагрузке4.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКЗагрузкеСумма1ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеКЗагрузке4.ТекущиеДанные;
	Если НЕ РазрешенаОтрицательнаяСумма И ТекущиеДанные.Сумма < 0 Тогда
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
	
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Цена = ТекущиеДанные.Сумма;
	Иначе
		ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл
		ТекущаяСтрока.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл
		ТекущаяСтрока.Отметка = Ложь;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузка(Команда)
	
	Если не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;

	ДанныеКЗагрузке.Очистить();
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПомещенияФайлаВоВременноеХранилище", ЭтотОбъект),, ПутьКФайлу, Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK); 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайломExcel

&НаКлиенте
Процедура ПослеПомещенияФайлаВоВременноеХранилище(Успешно, АдресВХранилище, ВыбранноеИмяФайла, ДопПараметры) Экспорт
	
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьФайлExcel(АдресВХранилище);
	
	ПоказатьОповещениеПользователя ("Чтение файла завершено");
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлExcel(АдресВХранилище)
	
	РасширениеФайла = Сред(ПутьКФайлу, СтрНайти(ПутьКФайлу, ".", НаправлениеПоиска.СКонца)+1);
	ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлуНаСервере);
	
	ТабДокИзФайла = новый ТабличныйДокумент;
	
	Попытка
		ТабДокИзФайла.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщить("Не удалось прочитать файл Excel: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = ТабДокИзФайла.ПолучитьРазмерОбластиДанныхПоВертикали();
	КоличествоКолонок = ТабДокИзФайла.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	
	// определяем поля к считыванию
	МассивПолей = Новый Массив;
	Если ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ТоварыНаСкладах Тогда
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "НоменклатураИзФайла", 	"Текст", НомерКолонкиНоменклатура, ""));
	    МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Артикул", 				"Текст", НомерКолонкиАртикул, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "ХарактеристикаИзФайла", 	"Текст", НомерКолонкиХарактеристика, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Количество", 				"Значение", НомерКолонкиКоличество, 0));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Цена", 					"Значение", НомерКолонкиЦена, 0));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Сумма", 					"Значение", НомерКолонкиСумма, 0));
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.МатериалыВЭксплуатации Тогда
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "НоменклатураИзФайла", 	"Текст", НомерКолонкиНоменклатура, ""));
	    МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Артикул", 				"Текст", НомерКолонкиАртикул, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "ХарактеристикаИзФайла", 	"Текст", НомерКолонкиХарактеристика, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Количество", 				"Значение", НомерКолонкиКоличество, 0));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Сумма", 					"Значение", НомерКолонкиСумма, 0));
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.РасчетыСПерсоналом Тогда
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "ФИОСотрудника", 			"Текст", НомерКолонкиФИОСотрудника, ""));
	    МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "ИННСотрудника", 			"Текст", НомерКолонкиИННСотрудника, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Сумма", 					"Значение", НомерКолонкиСумма, 0));
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.РасчетыСПодотчетниками Тогда
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "ФИОСотрудника", 			"Текст", НомерКолонкиФИОСотрудника, ""));
	    МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "ИННСотрудника", 			"Текст", НомерКолонкиИННСотрудника, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Сумма", 					"Значение", НомерКолонкиСумма, 0));
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ДенежныеСредства Тогда
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "НаименованиеКассы", 		"Текст", НомерКолонкиНаименованиеКассы, ""));
	    МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "НомерСчета", 				"Текст", НомерКолонкиНомерСчета, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Сумма", 					"Значение", НомерКолонкиСумма, 0));
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.БонусыКонтрагентов Тогда
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "ИННКонтрагента", 			"Текст", НомерКолонкиИННКонтрагента, ""));
	    МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "НаименованиеКонтрагента", "Текст", НомерКолонкиНаименованиеКонтрагента, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "НомерКарты", 				"Текст", НомерКолонкиНомерКарты, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Сумма", 					"Значение", НомерКолонкиСумма, 0));
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ВзаиморасчетыСКонтрагентами Тогда
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "ИННКонтрагента", 			"Текст", НомерКолонкиИННКонтрагента, ""));
	    МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "НаименованиеКонтрагента", "Текст", НомерКолонкиНаименованиеКонтрагента, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "НаименованиеДоговора", 	"Текст", НомерКолонкиДоговор, ""));
		МассивПолей.Добавить(Новый Структура("КолонкаТаблицыДанных, ТипЗначения, НомерКолонки, ЗначениеПоУмолчанию", "Сумма", 					"Значение", НомерКолонкиСумма, 0));
		
	КонецЕсли;	
		
	Для НомерСтроки = НачСтр По КоличествоСтрок Цикл		
		Стр = ДанныеКЗагрузке.Добавить();
		Для каждого ЭлементМассива из МассивПолей Цикл
			Стр[ЭлементМассива.КолонкаТаблицыДанных] = ТекстЗначениеИзОбласти(ЭлементМассива.ТипЗначения, ТабДокИзФайла, НомерСтроки, ЭлементМассива.НомерКолонки, ЭлементМассива.ЗначениеПоУмолчанию);
			
			Если ЭлементМассива.КолонкаТаблицыДанных = "Сумма"
				И НЕ РазрешенаОтрицательнаяСумма 
				И Стр.Сумма < 0 Тогда
				Стр.Сумма = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ТоварыНаСкладах
		ИЛИ ТипОперации = Перечисления.ТипыОперацийВводаОстатков.МатериалыВЭксплуатации
		Тогда
		
		Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл
			Если НомерКолонкиСумма = 0 И НЕ НомерКолонкиЦена = 0  Тогда
				ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			КонецЕсли;
			Если НомерКолонкиЦена = 0 И НЕ НомерКолонкиСумма = 0  Тогда
				ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ?(ТекущаяСтрока.Количество = 0, 1, ТекущаяСтрока.Количество);
			КонецЕсли;
		КонецЦикла;
		
		СопоставитьНоменклатуру();
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.РасчетыСПерсоналом
		ИЛИ ТипОперации = Перечисления.ТипыОперацийВводаОстатков.РасчетыСПодотчетниками
		Тогда
		СопоставитьСотрудников();
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ДенежныеСредства
		Тогда
		СопоставитьКассы();
		СопоставитьБанковскиеСчета();

	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ВзаиморасчетыСКонтрагентами
		Тогда
		СопоставитьКонтрагентов(Истина, Ложь);
		
	ИначеЕсли ТипОперации = Перечисления.ТипыОперацийВводаОстатков.БонусыКонтрагентов
		Тогда
		СопоставитьКонтрагентов(Ложь, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗначениеИзОбласти(ТипТекстЗначение, ТабДокИзФайла, НомерСтроки, НомерКолонки, ЗначениеПоУмолчанию = "")
	
	Если НомерСтроки = 0 ИЛИ НомерКолонки = 0 Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Попытка
		ОбластьЯчеек = ТабДокИзФайла.Область("R" + Формат(НомерСтроки, "ЧГ=") +"C" + Формат(НомерКолонки, "ЧГ="));	
		ТекстЗначение = ОбластьЯчеек[ТипТекстЗначение];
		Если ТипЗнч(ТекстЗначение) = Тип("Строка") Тогда
			ТекстЗначение = СокрЛП(ТекстЗначение);	
		КонецЕсли;
		Возврат ТекстЗначение;
	Исключение
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
		
КонецФункции

#КонецОбласти

#Область СопоставлениеДанных

&НаСервере
Процедура СопоставитьНоменклатуру()
	
	Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл
		
		Если ТекущаяСтрока.Номенклатура.Пустая() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	НЕ Номенклатура.ЭтоГруппа
			|	И ((Номенклатура.Наименование = &Наименование
			|				И НЕ &Наименование = &ПустаяСтрока)
			|			ИЛИ (Номенклатура.Артикул = &Артикул
			|				И НЕ &Артикул = &ПустаяСтрока))";
			Запрос.УстановитьПараметр("Наименование", ТекущаяСтрока.НоменклатураИзФайла);
			Запрос.УстановитьПараметр("Артикул", ТекущаяСтрока.Артикул);
			Запрос.УстановитьПараметр("ПустаяСтрока", "");
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока.Номенклатура = Выборка.Ссылка;
				ТекущаяСтрока.Отметка = Истина;
			КонецЦикла;
		КонецЕсли;
		
		// Нужно найти характеристику при наличии
		Если ЗначениеЗаполнено(СокрЛП(ТекущаяСтрока.ХарактеристикаИзФайла)) И ТекущаяСтрока.ХарактеристикаНоменклатуры.Пустая() И НЕ ТекущаяСтрока.Номенклатура.Пустая() Тогда
			ТекущаяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(СокрЛП(ТекущаяСтрока.ХарактеристикаИзФайла), Истина,, ТекущаяСтрока.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьКонтрагентов(ПоискДоговора = Ложь, ПоискКарты = Ложь)
	
	Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл
		
		Если ТекущаяСтрока.Номенклатура.Пустая() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеСправочника.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК ДанныеСправочника
			|ГДЕ
			|	НЕ ДанныеСправочника.ЭтоГруппа
			|	И (ДанныеСправочника.Наименование = &Наименование
			|				И НЕ &Наименование = &ПустаяСтрока
			|			ИЛИ ДанныеСправочника.ИНН = &ИНН
			|				И НЕ &ИНН = &ПустаяСтрока)";
			
			Запрос.УстановитьПараметр("Наименование", ТекущаяСтрока.НаименованиеКонтрагента);
			Запрос.УстановитьПараметр("ИНН", ТекущаяСтрока.ИННКонтрагента);
			Запрос.УстановитьПараметр("ПустаяСтрока", "");
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока.Контрагент = Выборка.Ссылка;
				ТекущаяСтрока.Отметка = Истина;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ ТекущаяСтрока.Контрагент.Пустая() Тогда
			Если ПоискДоговора И ЗначениеЗаполнено(СокрЛП(ТекущаяСтрока.НаименованиеДоговора)) Тогда
				ТекущаяСтрока.Договор = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(СокрЛП(ТекущаяСтрока.НаименованиеДоговора), Истина,, ТекущаяСтрока.Контрагент);
			КонецЕсли;
			
			Если ПоискКарты И ЗначениеЗаполнено(СокрЛП(ТекущаяСтрока.НомерКарты)) Тогда
				ТекущаяСтрока.ДисконтнаяКарта = Справочники.ДисконтныеКарты.НайтиПоНаименованию(СокрЛП(ТекущаяСтрока.НомерКарты), Истина,, ТекущаяСтрока.Контрагент);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьСотрудников()
	
	Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл
		
		Если НЕ ТекущаяСтрока.Сотрудник.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК ДанныеСправочника
		|ГДЕ
		|	НЕ ДанныеСправочника.ЭтоГруппа
		|	И (ДанныеСправочника.Наименование = &Наименование
		|				И НЕ &Наименование = &ПустаяСтрока
		|			ИЛИ ДанныеСправочника.ИНН = &ИНН
		|				И НЕ &ИНН = &ПустаяСтрока)";
		Запрос.УстановитьПараметр("Наименование", ТекущаяСтрока.ФИОСотрудника);
		Запрос.УстановитьПараметр("ИНН", ТекущаяСтрока.ИННСотрудника);
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущаяСтрока.Сотрудник = Выборка.Ссылка;
			ТекущаяСтрока.Отметка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьКассы()
	
	Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл
		//++ 16310
		//Если НЕ ТекущаяСтрока.СчетКасса.Пустая() Тогда
		//	Продолжить;
		//КонецЕсли;
		Если ЗначениеЗаполнено(ТекущаяСтрока.СчетКасса) Тогда
			Продолжить;
		КонецЕсли;
		//-- 16310
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Кассы КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Владелец = &Организация
		|	И ДанныеСправочника.Наименование = &Наименование
		|	И НЕ &Наименование = &ПустаяСтрока";
		Запрос.УстановитьПараметр("Наименование", ТекущаяСтрока.НаименованиеКассы);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущаяСтрока.СчетКасса = Выборка.Ссылка;
			ТекущаяСтрока.Отметка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьБанковскиеСчета()
	
	Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл
		//++ 16310
		//Если НЕ ТекущаяСтрока.СчетКасса.Пустая() Тогда
		//	Продолжить;
		//КонецЕсли;
		Если ЗначениеЗаполнено(ТекущаяСтрока.СчетКасса) Тогда
			Продолжить;
		КонецЕсли;
		//-- 16310
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Владелец = &Организация
		|	И ДанныеСправочника.НомерСчета = &НомерСчета
		|	И НЕ &НомерСчета = &ПустаяСтрока";
		Запрос.УстановитьПараметр("НомерСчета", ТекущаяСтрока.НомерСчета);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущаяСтрока.СчетКасса = Выборка.Ссылка;
			ТекущаяСтрока.Отметка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ЗаписатьРезультатВХранилище(УникальныйИдентификаторВладельца) 
		
	АдресВХранилище = Неопределено;	
	Если ПеренестиВДокумент Тогда
		
		ТаблицаРезультата = ДанныеКЗагрузке.Выгрузить();
		ТаблицаРезультата.Очистить();
		Для каждого СтрокаТЗ из ДанныеКЗагрузке Цикл
			Если НЕ СтрокаТЗ.Отметка Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТаблицаРезультата.Добавить(), СтрокаТЗ);
		КонецЦикла;
		АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаРезультата, УникальныйИдентификаторВладельца);	
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

#КонецОбласти
